<?php
$data1 = array(15,30,21,100,52);

// 昇順でソート（2つ目の引数を省略、数値としてソート）
sort($data1);
print_r($data1);
//Array
//(
//    [0] => 15
//    [1] => 21
//    [2] => 30
//    [3] => 52
//    [4] => 100
//)

echo "\n";

// 文字としてソート
sort($data1, SORT_STRING);
print_r($data1);
//Array
//(
//    [0] => 100
//    [1] => 15
//    [2] => 21
//    [3] => 30
//    [4] => 52
//)

echo "\n";

// 数値としてソート、は2番目の引数を省略したときと同じ挙動か
sort($data1, SORT_NUMERIC);
print_r($data1);
//Array
//(
//    [0] => 15
//    [1] => 21
//    [2] => 30
//    [3] => 52
//    [4] => 100
//)

echo "\n";

// 降順でソート
rsort($data1);
print_r($data1);
//Array
//(
//    [0] => 100
//    [1] => 52
//    [2] => 30
//    [3] => 21
//    [4] => 15
//)